local function run(msg, matches)
if matches[1] == "بای" then
      if msg.to.type == 'channel' or 'chat' then
            local answers = {'بای','خدافز','خدانگهدار','برو دیگگههه😒','ای دون برو به سلامت','بابای عشقم','خدافز به بابا هم سلام برسون','بای بای','bb azizam'}
            return answers[math.random(#answers)]
      end
	   end
	  if matches[1] == "خدافظ" then
      if msg.to.type == 'channel' or 'chat' then
            local answers = {'بای','خدافز','خدانگهدار','برو دیگگههه😒','ای دون برو به سلامت','بابای عشقم','خدافز به بابا هم سلام برسون','بای بای','bb azizam'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "خوبی؟" then
      if msg.to.type == 'channel' or 'chat' then
            local answers = {'ممنون','تشکر','به خوبی شما','عالی','مرسی نفسم','مرسی عشقم','من خوبم.خانواده خوبن؟','مرسی اه','khobam❤️'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "خوبی" then
      if msg.to.type == 'channel' or 'chat' then
            local answers = {'ممنون','تشکر','به خوبی شما','عالی','مرسی نفسم','مرسی عشقم','من خوبم.خانواده خوبن؟','مرسی اه','khobam❤️'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "خوبین" then
      if msg.to.type == 'channel' then
            local answers = {'ممنون','تشکر','به خوبی شما','عالی','مرسی نفسم','مرسی عشقم','من خوبم.خانواده خوبن؟','مرسی اه','khobam❤️'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "😐" then
      if msg.to.type == 'channel' or 'chat' then
            local answers = {'😐عجب','😐خخخ بسه','مرگ من بسه','جون عمت نفرست','نفرست اههه','پوووووف','داری روانیم میکنیاااا','مرسی اه','نفرست دیگ بسه ','هه هه مسخره همش پوکر میده','بفرست تا جونت در بیاد','الان که چی پوکر میدی','خیلی زیاد میفرستی','وای تو شاه پوکری که '}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "شب بخیر" then
      if msg.to.type == 'channel' or 'chat' then
            local answers = {'همچنین','تشکر','مرسی ممنون','شب بخیر','شب خوبی داشته باشید','شب خوبی برای شما ارزومندم','خدانگهدار گرامی','یاعلی برادر','#GN'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "اصل" then
     if msg.to.type == 'channel' or 'chat' then
            local answers = {'اصل چیه؟','برای چیته آخه','به من رحم کن 😖','پووووووف اصل برای چیته','هوووووم','چی بگم','من رباتم و دارم چیزای زیادی یاد میگیرم.قول بده اذیتم نکنی چون اذیتت میکنماااا😶😁','اصررا نکن اصل نمیدم','نمیدم'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == 'سلام' then
			if msg.to.type == 'channel' or 'chat' then
            local answers = {'سلام خوبی؟','سلام عشقم','سلام','سلام جیگر گروه','سلام گلم','چند بار سلام میکنی','سلام خخخخ','😐سلام','سهلام 😐😐','درود دوست عزیز'}
            return answers[math.random(#answers)]
			end
	  end
	  if matches[1] == "ربات" then
      if msg.to.type == 'channel' or 'chat' then
            local answers = {'جوووووون عشقم','اینقدر منو صدا نزن','اذیتم نکن همش','چیزی میخوای از من؟','بگو دیگه عه','بلهههه؟','منو صدا میزنی خوشکلم؟','واییی جون دلم🙈','جججوووونن عشقم❤️'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "😍" then
      if msg.to.type == 'channel' or 'chat' then
            local answers = {'واهاییی','عاشقتم','بوج بده عشقم','بووووووس','دوست دارم','عشقمیییی تو','بوس بوس','فدات بشم من','❤️❤️❤️'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "لینک" then
      if msg.to.type == 'channel' or 'chat' then
            local answers = {'لینک برای چیته اخه','لینک کجا رو میخوای','لینک گروهو میخوای؟','لینک نداریم برو','میگم نداریم عه','الان دقیقا لینک اینجا رو میخوای؟','لینک برا چیته کلک','باید وایسی مدیر بیاد','خخخ لینک کجا بود'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "اره" then
      if msg.to.type == 'channel' or 'chat' then
            local answers = {'چی اره؟','مسخره کردیاا','مگه من با تو شوخی دارم','من رباتم چی میخوای از دستم','ولم کن مستر ','نمیدم اصلا','ندارم جون تو','نمییییدیییمم','ول کن برو ندارم'}
            return answers[math.random(#answers)]
      end
	   end
	  if matches[1] == "😒" then
      if msg.to.type == 'channel' or 'chat' then
            local answers = {'هوم؟؟؟','مسخره کردیاا','مگه من با تو شوخی دارم','چته','روانی ','گمجو اصن','برو خونتون','هاااااااااان😒','برو بچه😒'}
            return answers[math.random(#answers)]
      end
	   end
	  if matches[1] == "خخخخ" then
      if msg.to.type == 'channel' or 'chat' then
            local answers = {'خخخخ','خنده داشت؟','بی مزهه','خوشمزه شدی','واییی جووون تو فقط بخند ','عاشق خنده هاتم','خنده هاتو دوست دارم','اوووف تو فقط بخند','عشقم بیا پی وی قربون خنده هات'}
            return answers[math.random(#answers)]
      end
	   end
	  if matches[1] == "😂" then
      if msg.to.type == 'channel' or 'chat' then
           local answers = {'😂😂😂','وای دلم😂','شما چقد خوش خنده ای عشقم😂','جوون تو فقط بخند 😂😂','اه بسه دیگه چقد میخندی','یکی اینو ببره تا از خنده غش نکرده😂','اوووف عاشق خنده هاتم😂','جدی بسه😂','خنده هات خیلی زیباست عشقم😂😂','لطقا تمومش کن','دیشب تو دریاچه نکن بودی انگار','بسه دیگه','کافیه برای چی میخندی','مسخره بازیا رو تموم کن','مسخره کردی منو؟'}
            return answers[math.random(#answers)]
      end
	   end
	  if matches[1] == "😔" then
      if msg.to.type == 'channel' or 'chat' then
           local answers = {'😔ناراحت نباش','گریه کن خالی شی عشقم','😔گریه نکن اشک درومد','بیا پی وی بت آرامش بدم','نمیای پی وی؟','اوووف هم ناراحتی','ناراحت نشو عزیزم','بیخیال ناراحت نباش'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "آرین" then
      if msg.to.type == 'channel' or 'chat' then
           local answers = {'وایی عشقم بابام','با بابام کاری داری؟','عشق منهه که','دوست دارم بابایی','بابایی بیا کارت دارن','واییی باباییییی','بوج برای بابام'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "😘" then
     if msg.to.type == 'channel' or 'chat' then
           local answers = {'😘😘','اووووف بوسم کرد','واییی تو گروه عشقم نکن','بیا پی وی عشقم','واهاییی','بوسه های زیباتو دوست دارم','بوووووووووووووج'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "بگو" then
      if msg.to.type == 'channel' or 'chat' then
           local answers = {'نمیگم','چرا بگم','مگه تو کی هستی به حرفت گوش بدم','نمیگم به تو هم ربطی نداره ','تو بگو ببینم بلدی','بگم؟','گمجو نمیگم بت'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "باشه" then
      if msg.to.type == 'channel' or 'chat' then
           local answers = {'باشه؟','چی باشه','باشه نه لاشه','باوشه بهتره بگی','به من چه ','خیلی خری ','خخخخخ خوب چی باشه'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "ممنون" then
      if msg.to.type == 'channel' or 'chat' then
           local answers = {'خ����اهش ��یکنم','وظیفست قربان','مرضو ممنون','هههههه ممنون که چی شد حالا گفتی','نیازی به تشکر تو ندارم','خودتو خر کن','خواهش'}
            return answers[math.random(#answers)]
      end
	  end
	  if matches[1] == "😕" then
     if msg.to.type == 'channel' or 'chat' then
           local answers = {'😕😕','چه مرگته تو','بمیر اصلا','مرسییی اه','گمجو به نظرم','دهنت چرا همیشه کجه تو؟','چته الان دقیقا','مشکلت چیه کسخل'}
            return answers[math.random(#answers)]
      end
	   end
end
return {
  description = "Chat With Robot Server", 
  usage = "chat with robot",
  patterns = {
    "^بای$",
	 "^خدافظ$",
	"^خوبی؟$",
	"^خوبی$",
	"^خوبین$",
	"^😐$",
	"^شب بخیر$",
	"^سلام$",
	"ربات",
	"😍",
	"😒",
	"😂",
	"😔",
	"😘",
	"بگو",
	"باشه",
	"ممنون",
	"😕",
    }, 
  run = run
}

--by @powershield_SUDO {@powershield_TEAM}
